#include "common.h"

typedef struct SpriteListing {
    char unk_00[4];
    void* bitmapP; // "malloc'd" after size calc.
    void* palletteP; //palette? both this and above start with devAddr+0XD73D960
    s32 type; // use "COLORMODE_*" enum
    void* unk10;
    u8 unk14;
    u8 tileCountX;
    u8 tileCountY;
    char unk17[3]; //align?
    u16 height; // height of each tile
    u16 width; // width of each tile
    u16 unk1E;
    char unk20[0x48]; //repeating substruct? has 5 feilds of color32
    s32 bitmapRom; //devAddr-0x8c26a0
    s32 paletteRom;
    s32 unk70;
    char unk_74[8];
} SpriteListing; //sizeof 0x78

typedef struct unk80174880 {
/* 0x00 */ s32 unk_00[4];
/* 0x10 */ char unk_10[0x18];
/* 0x28 */ s32 unk_28[4];
/* 0x38 */ char unk_38[0x18];
/* 0x50 */ s32 unk_50[4];
/* 0x60 */ char unk_60[0x18];
/* 0x78 */ s32 unk_78;
/* 0x7C */ s32 unk_7C;
} unk80174880;

extern unk80174880 D_80174880[];
extern SpriteListing gSpriteListings[230];
extern char D_8010CA1C[];
extern char D_8010CA54[];
extern Addr D_8C26A0;
extern unkStruct02* D_80176F4C;

void DummiedPrintf2(char* arg0, ...) {

}

void Rand_SetSeed(s32 arg0) {
    rngSeed = arg0;
}

s32 Rand(void) {
    u32 y, z;
    y = rngSeed * 4 + 2;
    z = y + 1;
    y = y * z;
    return rngSeed = y / 4;
}

void func_80055C04(void) {
    s32 i;
    
    D_800F68A8 = 1;
    
    for (i = 0; i < 4; i++) {
        D_800F6888[i] = -1;
        D_800F6898[i] = -1;
    }
}

void func_80055C74(void) {
    D_800F68A8 = 0;
}

void func_80055C80(void) {
    D_800F68A8 = 1;
}

s32 func_80055C90(void) {
    return D_800F68A8;
}
// simplify joystick movement to d-pad equivalent
void Controller_ParseJoystick(contMain* arg0) {
    s32 i;
    f32 f0,f1;

    for (i = 0; i < MAXCONTROLLERS; i++) {
        D_800F6888[i] = D_800F6898[i];
        D_800F6898[i] = arg0[i].buttons0;
